{
  "backend/main.mo": "Main Motoko actor defining all types (JobRole, Employee, LeaveEntry, Task, ContactMessage, Payslip, UserProfile, etc.) and implementing CRUD operations for HR management, authentication, authorization, and employee/HR dashboards with access control integration.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: fixing the 'Create employee' button in EmployeesPage.tsx and ensuring EmployeeForm.tsx properly handles employee creation with backend mutation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including pages, components, layouts, and routing structure with detailed descriptions of functionality, UI enhancements, and authentication flows.",
  "frontend/BUILDING.md": "Documentation for building and deploying the application, covering frontend build process.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for backgrounds, foregrounds, borders, charts, sidebar, and other UI elements.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application router setup using TanStack Router, defining all public routes (home, about, services, recruitment, contact, etc.), HR dashboard routes, and employee dashboard route with appropriate layout wrappers and authentication guards.",
  "frontend/src/components/animations/HoverSlideInText.tsx": "A simple wrapper component that applies hover-triggered slide-in animation to text content with optional delay. Uses inline-block display and CSS class-based animation.",
  "frontend/src/components/animations/SlideInOnViewText.tsx": "A text animation component that triggers a slide-in-right animation when the element enters the viewport using the useInView hook. Supports one-time trigger and configurable delay.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied screen with different messages for unauthenticated vs unauthorized users. Provides login button for unauthenticated users and home navigation for unauthorized users.",
  "frontend/src/components/auth/AdminProtectedRoute.tsx": "A route guard component that checks both authentication and admin status, showing loading states during checks and AccessDeniedScreen if user is not authenticated or not an admin.",
  "frontend/src/components/auth/EmployeeProtectedRoute.tsx": "A route guard that verifies user authentication and employee association status, displaying loading states or AccessDeniedScreen as appropriate before rendering protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "A button component that toggles between login and logout states, handles Internet Identity authentication flow, and clears query cache on logout. Shows loading spinner during authentication.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A modal dialog that appears for authenticated users without a profile, prompting them to enter name and email. Prevents dismissal until profile is created and uses mutation for saving.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "A basic route guard that checks authentication status and shows loading spinner during initialization or AccessDeniedScreen if not authenticated.",
  "frontend/src/components/auth/RoleProtectedRoute.tsx": "A route guard component that verifies user authentication, showing loading state during initialization and AccessDeniedScreen for unauthenticated users before rendering protected content.",
  "frontend/src/components/contact/ContactForm.tsx": "A contact form component with name, email, and message fields that validates input and submits via mutation hook. Shows loading states and toast notifications for success/error feedback.",
  "frontend/src/components/contact/ContactMessageList.tsx": "Displays a list of contact messages sorted by timestamp in descending order, showing sender info, timestamp, read/new status badge, and message content in card format.",
  "frontend/src/components/contact/ContactSection.tsx": "Displays a contact section with a form and contact information cards (email, phone, office location, business hours). Uses intersection observer hooks for scroll-based animations and supports configurable visibility of title, description, and business hours.",
  "frontend/src/components/employee/MyLeavePanel.tsx": "Renders an employee's leave dashboard showing leave balance and total leaves taken in summary cards, plus a table of leave history entries with status badges. Handles loading states and formats dates for display.",
  "frontend/src/components/employee/MyTasksList.tsx": "Displays a list of tasks assigned to an employee with completion status icons, priority badges, and due dates. Shows loading spinner or empty state when appropriate.",
  "frontend/src/components/employee/TimeOffRequestForm.tsx": "Form component for employees to submit time-off requests with start/end dates, leave type selection, and reason textarea. Validates date ranges and submits requests via mutation hook with toast notifications.",
  "frontend/src/components/employees/EmployeeForm.tsx": "Form for creating new employees or updating existing employee salary, with fields for name, joining date, base salary, PF details, and bonus. Handles both create and update mutations with validation and success callbacks.",
  "frontend/src/components/employees/EmployeesTable.tsx": "Table component displaying employee list with columns for name, joining date, base salary, and leave balance. Includes action buttons for viewing details, tasks, salary, and payslips that navigate to respective routes.",
  "frontend/src/components/jobroles/JobRoleForm.tsx": "Form component for creating new job roles with fields for title, location (city/country), description, and LinkedIn URL. Includes validation and uses the useCreateJobRole mutation hook.",
  "frontend/src/components/jobroles/JobRolesTable.tsx": "Table component that displays job roles with columns for title, location, status badge (open/closed), and a LinkedIn link action button.",
  "frontend/src/components/LeadershipCard.tsx": "Reusable card component displaying leadership team member information with gradient icon background, responsive layout, and hover effects.",
  "frontend/src/components/leaves/LeaveEntriesPanel.tsx": "Panel component for managing employee leave entries with a table view, total leaves counter, and a dialog for adding new leave entries. Includes loading states and responsive layout.",
  "frontend/src/components/leaves/LeaveEntryForm.tsx": "Form component for adding leave entries with start date, end date, and reason fields. Validates date ranges and converts timestamps to nanoseconds for backend submission.",
  "frontend/src/components/nav/FadeNavLabel.tsx": "Wrapper component that applies fade-in animation and opacity transitions to navigation labels, with motion-reduce fallback support.",
  "frontend/src/components/nav/MobileMenuToggleIcon.tsx": "Animated hamburger menu icon that transforms into an X when open, with motion-safe transitions and motion-reduce fallback rendering.",
  "frontend/src/components/payslips/PayslipsList.tsx": "Displays a sorted list of employee payslips by month/year with download functionality, showing generation date and final payable amount for each entry.",
  "frontend/src/components/PublicLayout.tsx": "Shared layout component with sticky header navigation, mobile sheet menu, logo, login button, smooth scroll handling for section navigation, and conditional employee dashboard link for authenticated employees.",
  "frontend/src/components/salary/SalaryBreakdownCard.tsx": "Card component that displays employee salary breakdown including base salary, bonus, PF deduction, and calculated final payable amount with color-coded values.",
  "frontend/src/components/ServiceCard.tsx": "A card component displaying service information with expandable details, featuring an icon, title, description, and action buttons (Quick View, Learn More, and conditional Compliance First). Supports keyboard navigation and smooth expand/collapse animations.",
  "frontend/src/components/services/ServiceQuickViewModal.tsx": "Modal dialog for quick preview of service details with icon, description, features list, and action buttons to view full details or navigate to compliance-first page.",
  "frontend/src/components/tasks/EmployeeMultiSelect.tsx": "A multi-select component for assigning employees to tasks, featuring search functionality, checkboxes for selection, and badge display of selected employees with removal capability.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "A dialog form component for creating and editing tasks with fields for title, description, due date, priority, employee assignment, and completion status, using mutations for create/update operations.",
  "frontend/src/components/tasks/TasksTable.tsx": "A table component displaying tasks with columns for title, due date, priority, assigned employees, and status, including edit and delete actions with confirmation dialog.",
  "frontend/src/data/services.ts": "Defines service offerings data structure and exports an array of four HR services (HR Consulting, Payroll Management, Compliance & Legal, Recruitment) with descriptions and features, plus a lookup function.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useBootstrapError.ts": "A minimal hook that returns null for bootstrap errors, with functionality for admin role assignment removed.",
  "frontend/src/hooks/useComplianceFirstFeed.ts": "Custom hook that fetches compliance and legal news articles from The Guardian API, returning formatted articles with 5-minute cache and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useInView.ts": "Custom hook using IntersectionObserver to detect when an element enters the viewport, with configurable threshold, root margin, and trigger-once options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with the backend actor, including user profile management, role assignment, employee CRUD operations, leave management, task management, payslip operations, and contact message handling.",
  "frontend/src/hooks/useTailoredSolutionsFeed.ts": "Provides a React Query hook that fetches HR and workplace-related articles from The Guardian API, returning a list of tailored solution articles with metadata.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, CSS custom properties for theming (light/dark mode), base styles for HTML elements, and custom animations for hero sections and hover effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About Us page with company mission, values (Excellence, Integrity, Innovation), and leadership team cards with animated sections.",
  "frontend/src/pages/ComplianceFirstPage.tsx": "Renders a page displaying compliance and legal news articles fetched via useComplianceFirstFeed hook, with loading, error, and empty states, plus animated card grid.",
  "frontend/src/pages/ContactPage.tsx": "Simple contact page wrapper that renders the ContactSection component with specific configuration options.",
  "frontend/src/pages/employee/EmployeeDashboardPage.tsx": "Employee dashboard page with tabs for profile, tasks, payslips, time-off, and leave management. Fetches and displays employee data, tasks, leave entries, and payslips using custom hooks.",
  "frontend/src/pages/GamePage.tsx": "Displays a grid of clickable game cards (Subway Surfers, Ludo, Chess, etc.) that open external game URLs in new tabs, designed as an employee relaxation feature.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component featuring hero section, services overview, recruitment highlights, and contact section with animated text effects and modal interactions for service quick views.",
  "frontend/src/pages/hr/AccessManagementPage.tsx": "Empty file with no content.",
  "frontend/src/pages/hr/ContactMessagesPage.tsx": "Placeholder page for viewing contact form messages with a card indicating the feature is not yet implemented.",
  "frontend/src/pages/hr/EmployeeDetailPage.tsx": "Detailed employee view page with tabs for overview, leave management, and editing. Displays employee information, salary breakdown, and leave entries with navigation back to employee list.",
  "frontend/src/pages/hr/EmployeesPage.tsx": "HR employees directory page with search functionality, employee table, and dialog for creating new employees. Includes responsive layout and filtering by name.",
  "frontend/src/pages/hr/HrEmployeePayslipsPage.tsx": "HR page for viewing and generating payslips for a specific employee. Includes dialog for selecting month/year to generate payslips and displays list of existing payslips.",
  "frontend/src/pages/hr/HrEmployeeSalaryPage.tsx": "HR page displaying detailed salary breakdown for a specific employee using the SalaryBreakdownCard component with navigation back to employee details.",
  "frontend/src/pages/hr/HrEmployeeTasksPage.tsx": "HR page showing all tasks assigned to a specific employee with priority badges, completion status, and task details including title, description, and dates.",
  "frontend/src/pages/hr/HrLayout.tsx": "Layout component for HR dashboard with a mobile-responsive sidebar menu containing navigation links (Employees, Tasks, Job Roles, Contact Messages, Quick Leave Mark) and logout functionality.",
  "frontend/src/pages/hr/JobRolesPage.tsx": "HR page for managing job roles with a table view of all job postings and a dialog to create new job roles using JobRoleForm component.",
  "frontend/src/pages/hr/QuickLeaveMarkPage.tsx": "HR page providing a form to quickly mark a single day leave for an employee, including employee selection, date, leave type, and reason fields.",
  "frontend/src/pages/hr/TasksPage.tsx": "HR page for task management displaying all tasks in a table with create/edit functionality via TaskFormDialog component.",
  "frontend/src/pages/RecruitmentPage.tsx": "Displays current job openings fetched from API with cards showing job title, location, description, and LinkedIn application links; includes loading and empty states.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Individual service detail page that displays service information including features, icon, description, and call-to-action buttons based on URL slug parameter.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all available HR services in a grid layout with service cards and quick view modal functionality for previewing service details.",
  "frontend/src/pages/TailoredSolutionsPage.tsx": "Displays a feed of tailored HR solutions and insights fetched from external source with loading, error, and empty states, presented in a responsive card grid.",
  "frontend/src/pages/TeamPage.tsx": "Showcases team members with photos, roles, and descriptions in an animated grid layout with hover effects and staggered entrance animations.",
  "frontend/src/utils/deployDiagnostics.ts": "Diagnostic utility that collects and logs runtime configuration (environment mode, canister IDs, build flags) to help troubleshoot deployment issues.",
  "frontend/src/utils/env.ts": "Environment variable accessor utilities for Vite that safely read from import.meta.env, including specialized helpers for Internet Identity URL configuration.",
  "frontend/src/utils/formatters.ts": "Formatting utilities for displaying currency (INR) and dates using Intl API with Indian locale conventions.",
  "frontend/src/utils/navigateHome.ts": "Navigation utility that handles homepage navigation, clearing URL hashes, and smooth scrolling to the home section.",
  "frontend/src/utils/payslipDownload.ts": "Utility to generate and download HTML payslip documents with formatted employee salary details, deductions, and company branding.",
  "frontend/src/utils/salary.ts": "Salary calculation utility that computes salary breakdown including base, bonus, PF deduction, leave deduction, and final payable amount from employee data.",
  "frontend/src/utils/scrollToSection.ts": "Utility functions for smooth scrolling to page sections by ID and mapping navigation paths to corresponding section IDs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended utilities, animations, and design tokens for a component library.",
  "project_state.json": "Project state tracking file documenting an HR management application with employee and HR dashboards, role-based access control, and pending fixes for employee creation functionality."
}