{
  "backend/main.mo": "Defines the main canister actor with types, maps, counters, authorization mixin, and initial query method for office address.",
  "backend/migration.mo": "Implements migration from old actor data to new format by adding payslip and principal-to-employee maps and initializing new counters.",
  "feature_evidence.json": "Lists feature evidence entries linking features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files for documentation or build reference.",
  "frontend/BUILDING.md": "Provides basic instructions for building and deploying the frontend application.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, dark mode overrides, and base styles.",
  "frontend/index.html": "Root HTML file bootstrapping the frontend app and loading the main React entrypoint.",
  "frontend/src/App.tsx": "Configures all application routes including public pages, employee dashboard, and HR-admin routes using TanStack Router.",
  "frontend/src/components/animations/HoverSlideInText.tsx": "Wraps text in a hover-triggered slide-in animation with optional delay.",
  "frontend/src/components/animations/SlideInOnViewText.tsx": "Animates text sliding in when it enters the viewport using an in-view hook.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied screen with context-specific messaging and login or navigation options.",
  "frontend/src/components/auth/AdminProtectedRoute.tsx": "Protects routes requiring admin access, showing loading or denial screens based on auth and admin checks.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout button behavior using Internet Identity with loading states and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to set up their profile and save name and email.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Guards routes for authenticated users, showing a loader or access denied if needed.",
  "frontend/src/components/auth/RoleProtectedRoute.tsx": "Wraps content requiring authentication, showing loading or access denied for unauthenticated users.",
  "frontend/src/components/contact/ContactForm.tsx": "Implements a contact form with validation, submission mutation, and success/error feedback.",
  "frontend/src/components/contact/ContactMessageList.tsx": "Displays a sorted list of contact messages with metadata, status badge, and message content.",
  "frontend/src/components/contact/ContactSection.tsx": "Renders a contact section with animated form and contact info cards using intersection observers.",
  "frontend/src/components/employees/EmployeeForm.tsx": "Form for creating or updating an employee, with validation and API mutations.",
  "frontend/src/components/employees/EmployeesTable.tsx": "Displays a table of employees with formatted fields and navigation actions.",
  "frontend/src/components/jobroles/JobRoleForm.tsx": "Form for creating job roles with validation and submission to backend.",
  "frontend/src/components/jobroles/JobRolesTable.tsx": "Renders a job roles table showing title, location, status, and a LinkedIn link.",
  "frontend/src/components/LeadershipCard.tsx": "Renders a styled leadership profile card with icon, name, title, and description.",
  "frontend/src/components/leaves/LeaveEntriesPanel.tsx": "Panel for viewing and adding employee leave entries with a dialog and table display.",
  "frontend/src/components/leaves/LeaveEntryForm.tsx": "Form for creating leave entries, validating dates and reason, and submitting via useAddLeaveEntry.",
  "frontend/src/components/nav/FadeNavLabel.tsx": "Animated span wrapper that fades nav label text on hover or focus.",
  "frontend/src/components/nav/MobileMenuToggleIcon.tsx": "Animated hamburger/X icon that changes appearance based on the open state with reduced‑motion support.",
  "frontend/src/components/payslips/PayslipsList.tsx": "Lists and sorts payslips with metadata and provides a download button for each.",
  "frontend/src/components/PublicLayout.tsx": "Defines the public site layout with navigation, mobile menu handling, and scroll-based section navigation.",
  "frontend/src/components/salary/SalaryBreakdownCard.tsx": "Card displaying an employee’s salary components and final payable amount.",
  "frontend/src/components/ServiceCard.tsx": "Renders an expandable service card with features list, quick view, and navigation actions.",
  "frontend/src/components/services/ServiceQuickViewModal.tsx": "Modal showing service details, features, and navigation options to full details or Compliance First.",
  "frontend/src/components/tasks/EmployeeMultiSelect.tsx": "Employee selector with search, checkboxes, and removable badges for assigned employees.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog for creating or editing tasks, handling fields, employee assignment, priority, and submitting mutations.",
  "frontend/src/components/tasks/TasksTable.tsx": "Table showing tasks with priority, assignees, status, and actions to edit or delete.",
  "frontend/src/data/services.ts": "Defines the Service interface and a list of service objects with metadata and features, plus a helper to fetch a service by slug.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useBootstrapError.ts": "Provides a hook returning a static null bootstrap error state.",
  "frontend/src/hooks/useComplianceFirstFeed.ts": "Fetches and caches compliance-related news from The Guardian via react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hooks for login, identity management, and AuthClient initialization.",
  "frontend/src/hooks/useInView.ts": "Implements an IntersectionObserver-based hook to detect when an element enters the viewport.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for interacting with backend actor methods for users, roles, employees, tasks, and related data.",
  "frontend/src/hooks/useTailoredSolutionsFeed.ts": "Fetches and caches HR and business-related articles from The Guardian via react-query.",
  "frontend/src/index.css": "Tailwind CSS base file defining theme variables, dark mode styles, global resets, and custom animations.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About Us page with mission, values, and leadership sections using styled cards and icons.",
  "frontend/src/pages/ComplianceFirstPage.tsx": "Displays a compliance news feed with loading, error, empty, and content states using animated cards.",
  "frontend/src/pages/ContactPage.tsx": "Shows the Contact Us page header and embeds the ContactSection component with business hours.",
  "frontend/src/pages/employee/EmployeeDashboardPage.tsx": "Renders an authenticated employee dashboard showing tasks, payslips, and profile info with loading and error fallback states.",
  "frontend/src/pages/GamePage.tsx": "Displays a grid of clickable game cards that open external game links in new tabs.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with animated hero text, services, navigation interactions, and contact sections.",
  "frontend/src/pages/hr/AccessManagementPage.tsx": "Empty placeholder page for HR access management.",
  "frontend/src/pages/hr/ContactMessagesPage.tsx": "Displays contact form submissions with loading skeletons and an empty state, using a message list component.",
  "frontend/src/pages/hr/EmployeeDetailPage.tsx": "Provides a detailed employee view with tabs for overview, leave entries, and editing, including loading and not-found states.",
  "frontend/src/pages/hr/EmployeesPage.tsx": "Displays employee directory with search, table view, and a dialog to add employees.",
  "frontend/src/pages/hr/HrEmployeePayslipsPage.tsx": "Loads an employee's payslips, allows generating new monthly payslips, and handles loading and missing states.",
  "frontend/src/pages/hr/HrEmployeeSalaryPage.tsx": "Shows detailed salary breakdown for a selected employee with loading and not-found handling.",
  "frontend/src/pages/hr/HrEmployeeTasksPage.tsx": "Displays tasks assigned to an employee with priority badges, loading state, and navigation controls.",
  "frontend/src/pages/hr/HrLayout.tsx": "Provides HR dashboard layout with navigation menu, mobile sidebar, and logout handling.",
  "frontend/src/pages/hr/JobRolesPage.tsx": "Lists open job roles, provides a dialog to add new roles, and shows skeletons while loading.",
  "frontend/src/pages/hr/QuickLeaveMarkPage.tsx": "Provides a form for HR to mark a single‑day leave for an employee using query hooks and UI components.",
  "frontend/src/pages/hr/TasksPage.tsx": "Displays all tasks with loading/error states and includes a dialog for creating or editing tasks.",
  "frontend/src/pages/RecruitmentPage.tsx": "Fetches and displays open job roles with loading placeholders, job cards, and a fallback when no roles exist.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Displays a detailed view of a selected service with features, description, and navigation controls, falling back to a not-found message if the service is missing.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a list of all services with quick-view modal support and an introductory description.",
  "frontend/src/pages/TailoredSolutionsPage.tsx": "Fetches and displays tailored HR solution articles with animated headers, handling loading, error, empty, and results states.",
  "frontend/src/pages/TeamPage.tsx": "Presents an animated team showcase with member profiles and images, triggered by scroll visibility.",
  "frontend/src/utils/deployDiagnostics.ts": "Collects and logs environment and build diagnostics plus actor and identity status to the console.",
  "frontend/src/utils/env.ts": "Utility for safely accessing Vite environment variables with helpers for defaults and II URL retrieval.",
  "frontend/src/utils/formatters.ts": "Contains currency and timestamp formatting helpers for INR and date display.",
  "frontend/src/utils/navigateHome.ts": "Handles navigation to the homepage and smooth scrolling, cleaning hashes when needed.",
  "frontend/src/utils/payslipDownload.ts": "Generates styled HTML for a payslip and prepares it for download using payslip data and formatting utilities.",
  "frontend/src/utils/salary.ts": "Calculates an employee’s salary breakdown including base, bonus, deductions, and final payable.",
  "frontend/src/utils/scrollToSection.ts": "Provides helpers to scroll smoothly to sections and map routes to section IDs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, animations, and container settings with extended theme utilities.",
  "project_state.json": "Project metadata describing HR/employee dashboard features, role-based access rules, payslip generation requirements, and pending feature requests."
}