{
  "backend/main.mo": "Defines types and maps for job roles, employees, leaves, contact messages, and user profiles with access‑controlled CRUD operations and system initialization.",
  "feature_evidence.json": "Lists feature evidence reports mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files describing layouts, pages, components, and behaviors.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "Basic HTML entry file loading the React application via main.tsx into the root div.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for public pages and protected HR dashboard pages with authentication guards.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with login and home navigation buttons.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button handling authentication state and errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog for new authenticated users to submit name and email to create their profile.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Wraps protected content, showing a loader during init or an access denied screen if unauthenticated.",
  "frontend/src/components/contact/ContactForm.tsx": "A form for sending contact messages with validation and submission handling.",
  "frontend/src/components/contact/ContactMessageList.tsx": "Renders a sorted list of contact messages with metadata and read status.",
  "frontend/src/components/contact/ContactSection.tsx": "Displays a contact section with animated form and contact info blocks.",
  "frontend/src/components/employees/EmployeeForm.tsx": "Form for creating or updating employee details including salary and joining date.",
  "frontend/src/components/employees/EmployeesTable.tsx": "Displays a table of employees with key details and navigation to each profile.",
  "frontend/src/components/jobroles/JobRoleForm.tsx": "Form component to create a job role, handling validation, LinkedIn URL checks, and triggering a create mutation.",
  "frontend/src/components/jobroles/JobRolesTable.tsx": "Displays a table of job roles with title, location, status, and a link to the LinkedIn posting.",
  "frontend/src/components/LeadershipCard.tsx": "Renders a card showing a leadership member's name, title, and description with an icon.",
  "frontend/src/components/leaves/LeaveEntriesPanel.tsx": "Panel showing an employee’s leave entries, total leaves taken, and a dialog for adding new entries.",
  "frontend/src/components/leaves/LeaveEntryForm.tsx": "Form for adding a leave entry with date validation and submission via mutation.",
  "frontend/src/components/PublicLayout.tsx": "Defines the public site layout with header navigation, mobile menu, smooth section scrolling, and authentication controls.",
  "frontend/src/components/salary/SalaryBreakdownCard.tsx": "Card component that displays calculated salary breakdown values for an employee.",
  "frontend/src/components/ServiceCard.tsx": "Displays a service card with icon, title, description, and a list of key features.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useInView.ts": "Custom hook using IntersectionObserver to track whether an element is in view with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, employees, job roles, and leave entries via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers and global CSS variables, themes, and base styles including dark mode and layout defaults.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company mission, values, and leadership information using styled components.",
  "frontend/src/pages/ContactPage.tsx": "Displays the Contact page layout and embeds the ContactSection component with business hours.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with sections, feature listings, hash-based scrolling, and open job roles count.",
  "frontend/src/pages/hr/ContactMessagesPage.tsx": "Displays all contact form messages, showing a loading skeleton or fallback when empty, and renders a message list when data is available.",
  "frontend/src/pages/hr/EmployeeDetailPage.tsx": "Shows detailed employee information with tabs for overview, leaves, and editing, handling loading and missing-employee states.",
  "frontend/src/pages/hr/EmployeesPage.tsx": "Lists all employees with search filtering, loading skeletons, and a dialog for adding new employees.",
  "frontend/src/pages/hr/HrLayout.tsx": "Provides the HR dashboard layout with sidebar navigation, mobile menu, and logout handling.",
  "frontend/src/pages/hr/JobRolesPage.tsx": "Displays active job roles with loading states and a dialog to create new job postings.",
  "frontend/src/pages/RecruitmentPage.tsx": "Shows open job roles with loading skeletons, job cards, and LinkedIn links using data from React Query.",
  "frontend/src/pages/ServicesPage.tsx": "Lists HR-related services and features, rendering each through the ServiceCard component.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency and timestamps into user-friendly strings.",
  "frontend/src/utils/salary.ts": "Calculates a salary breakdown including base pay, bonus, deductions, and final payable amount.",
  "frontend/src/utils/scrollToSection.ts": "Provides smooth scrolling to sections and maps route paths to section IDs.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and plugins for a themed UI with container queries and typography.",
  "project_state.json": "Project state metadata describing website requirements, architecture notes, existing features, and known issues for an HR consulting site."
}