{
  "kind": "build_request",
  "title": "Make the site logo act as a Home button (always navigate to the main homepage)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-61",
      "text": "Update the public site logo area in `frontend/src/components/PublicLayout.tsx` so that clicking the logo navigates the user directly to the main homepage route (`/`) from any current route.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "make if anyone click on logo user directly go to home page",
          "yes. build"
        ]
      },
      "acceptanceCriteria": [
        "When the user clicks the header logo on any route (e.g., `/services`, `/contact`, `/hr/employees`), the app navigates to `/` using client-side navigation (no full page reload).",
        "The logo click target is keyboard-accessible (focusable) and has appropriate accessible labeling (e.g., link/button semantics and/or aria-label).",
        "Existing navigation behaviors remain unchanged (smooth-scroll section links, HR Dashboard button routing, mobile menu open/close behavior)."
      ]
    },
    {
      "id": "REQ-62",
      "text": "Make the footer logo/brand area in `frontend/src/components/PublicLayout.tsx` also navigate to the main homepage route (`/`) when clicked, matching the header logo behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make if anyone click on logo user directly go to home page"
        ]
      },
      "acceptanceCriteria": [
        "When the user clicks the footer logo/brand area on any route, the app navigates to `/` using client-side navigation (no full page reload).",
        "The footer logo/brand click target is keyboard-accessible (focusable) and has appropriate accessible labeling (e.g., link/button semantics and/or aria-label)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed as immutable in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui/*`).",
    "Keep all user-facing text in English.",
    "Do not change existing navigation item labels or their smooth-scroll behavior."
  ],
  "nonGoals": [
    "Do not change the existing section anchor IDs or smooth-scroll implementation.",
    "Do not add new pages, routes, or backend methods for this change.",
    "Do not change the logo image asset or generate new images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}