{
  "kind": "build_request",
  "title": "Redesign and animate the entire Contact section (professional + dynamic)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Redesign the entire public Contact experience to look more attractive and professional, applying consistent visual improvements to both (a) the on-page Contact section on the main public page (HomePage section with id=\"contact\") and (b) the standalone Contact page, while keeping the existing fields, content, and submission behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "make  contact information look attractive. animated",
          "1. entire contact section",
          "professional and dynamic"
        ]
      },
      "acceptanceCriteria": [
        "The on-page Contact section (Home page section id=\"contact\") and the standalone Contact page present a clearly improved, professional layout (typography, spacing, card styling, and hierarchy) without removing any existing information or form fields.",
        "The existing ContactForm submission flow remains unchanged: same validations, same success/error toasts, and still submits using the existing React Query mutation hook.",
        "Mobile/tablet/desktop layouts remain responsive with no overlap/clipping and with comfortable spacing across breakpoints.",
        "No new routes, navigation items, or backend APIs are introduced as part of this redesign."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add professional, dynamic animations to the entire Contact section (form + contact info) including (1) an entrance animation when the section/cards become visible and (2) subtle hover/focus micro-interactions on interactive elements, while respecting accessibility best practices (including reduced-motion preferences).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "animated",
          "anything",
          "professional and dynamic"
        ]
      },
      "acceptanceCriteria": [
        "The Contact section content animates into view in a subtle, professional way (e.g., fade/slide with stagger) when scrolled into view, affecting both the form area and the contact-info area/cards.",
        "Interactive elements (links, cards, inputs, submit button) have subtle hover/focus animations that do not distract or reduce readability.",
        "Animations respect user motion preferences: when the user has reduced motion enabled, animations are removed or significantly minimized (no large movement).",
        "Animations do not cause layout shift (no reflow that changes layout height/width during animation) and do not block interaction with the form.",
        "Keyboard navigation remains clear: focus states are visible and any animations do not hide or delay focus indicators."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose only).",
    "Keep all user-facing text in English.",
    "Do not change the backend canister code or schemas for this request.",
    "Do not change the existing ContactForm field set (name, email, message) or its submission/validation behavior."
  ],
  "nonGoals": [
    "Adding new contact channels (e.g., WhatsApp, live chat) or new form fields.",
    "Changing or adding authentication/authorization for contact submissions.",
    "Building real-time messaging or notification features.",
    "Replacing the existing UI library components under frontend/src/components/ui."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}