{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "HR and Employee dashboard system: add an employee dashboard accessible from the sidebar under the HR dashboard, showing each employee’s daily tasks, salary details, and downloadable payslips. HR dashboard should link per-employee to tasks/salary/payslips, with automatic payslip generation and role-based access (HR sees all employees; employees see only their own data).",
  "architectural_notes": [
    "Role-based data access: HR has global access; employee accounts restricted to self data.",
    "Payslips should be generated automatically (document generation pipeline) and stored for download."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-add-an-employee-dashboard-entry-in-the-left-sidebar-navigation-sheet-menu-directly-below-the-existing-hr-dashboard-section-and-implement-routing-so-authenticated-employee-users-can-open-the-employee-dashboard-without-using-hr-only-routes",
      "title": "Add an Employee Dashboard entry in the left sidebar navigation (Sheet menu) directly below the existing HR Dashboard section, and implement routing so authenticated employee users can open the Employee Dashboard without using HR-only routes.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-create-an-employee-dashboard-page-that-shows-1-the-employee-s-daily-tasks-2-the-employee-s-salary-details-and-3-a-payslips-section-where-the-employee-can-download-automatically-generated-payslips",
      "title": "Create an Employee Dashboard page that shows: (1) the employee’s daily tasks, (2) the employee’s salary details, and (3) a payslips section where the employee can download automatically generated payslips.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-add-hr-side-deep-links-actions-from-the-hr-employees-list-so-each-employee-row-has-buttons-links-to-view-that-specific-employee-s-tasks-salary-details-and-payslips",
      "title": "Add HR-side deep links/actions from the HR Employees list so each employee row has buttons/links to view that specific employee’s Tasks, Salary details, and Payslips.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-automatic-payslip-generation-and-downloading-payslips-must-be-generated-automatically-from-stored-salary-data-no-manual-uploads-and-employees-must-be-able-to-download-generated-payslips",
      "title": "Implement automatic payslip generation and downloading: payslips must be generated automatically from stored salary data (no manual uploads) and employees must be able to download generated payslips.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add Employee Dashboard in sidebar below HR Dashboard with sections for daily tasks, salary details, and downloadable payslips",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add per-employee links/actions from HR dashboard to view that employee’s tasks, salary details, and payslips",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Implement automatic payslip generation and allow employees to download generated payslips",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Enforce role-based access: HR can view all employees’ tasks/salary/payslips; employees can view only their own",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Implement backend support to associate an authenticated Principal with an EmployeeId, and enforce role-based access so HR/admin users can view any employee’s tasks/salary/payslips while employees can only view their own tasks/salary/payslips.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Add Employee Dashboard with tasks, salary, and downloadable payslips linked from HR Employees list",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}